#ifndef LOGIC_LR3_TEST_HPP
#define LOGIC_LR3_TEST_HPP

#include "../base/includes.hpp"

namespace unit_testing {
    void test_lr3() {
        /// Разработать и реализовать набора классов для взаимодействия пользователя с юнитами и базой. Основные требования:
        /// - Должен быть реализован функционал управления юнитами
        /// - Должен быть реализован функционал управления базой
        /// Баллы
        /// ~ Выполнены все основные требования к взаимодействию 6 баллов
        /// ~ Добавлен функционал просмотра состояния базы 3 балла
        /// ~ Имеется 3+ демонстрационных примера 1 балл
        /// ~ *Реализован паттерн “Фасад” через который пользователь управляет программой 1 балл
        /// ~ *Объекты между собой взаимодействуют через паттерн “Посредника” 3 балла
        /// ~ *Для передачи команд используется паттерн “Команда” 3 балла
        /// ~ *Для приема команд от пользователя используется паттерн “Цепочка обязанностей” 3 балла
    }
}

#endif //LOGIC_LR3_TEST_HPP
